#include <stdio.h>
#include <locale.h>
#include <math.h>
int main()
{
    setlocale(LC_ALL, "Rus");
    int Q = 0, i = 0;
    while (i < 7){
        printf("Введите номер задания:");
        scanf("%d",&Q);
        i++;
        if(Q == 1){
            int A = 0, B = 0;
            printf("\nВведите A,B:");
            scanf("%d %d",&A,&B);
            if (A>2){printf("\nA>2 - Истино\n");}
            else{printf("\nA>2 - ложно\n");}
            if (B<=3){printf("B<=3 - Истино\n");}
            else{printf("B<=3 - ложно\n");}
            printf("/////////////////////////////////////////////////////////////////\n");
        } 
        if(Q == 2){
            int A = 0, B = 0,C = 0;
            printf("\nВведите A,B,C:");
            scanf("%d %d %d",&A,&B,&C);
            if(A<B && B<C){printf("A<B<C - Истино\n");}
            else{printf("A<B<C - Ложно\n");}
            printf("/////////////////////////////////////////////////////////////////\n");
        }
        if(Q == 3){
            printf("\nВведите число:");
            int K = 0;
            scanf("%d",&K);
            if(K%2 == 0 && K%100 == K && K%10 != K){printf("Данное число является четным двузначным\n");}
            else{printf("Данное число НЕ является чётным и двухзначным\n");}
            printf("/////////////////////////////////////////////////////////////////\n");
        }
        if(Q == 4){
            int A =0;
            printf("\nВведите трёхзначное число =");
            scanf("%d",&A);
            if((A%10 > A/10%10 &&  A/10%10 > A/100%10) || (A/100%10 > A/10%10 && A/10%10 > A%10)){
                printf("Цифры данного числа образуют возрастающую или убывающую последовательность\n");
            }
            else{printf("Цифры данного числа НЕ образуют возрастающую или убывающую последовательность\n");}
            printf("/////////////////////////////////////////////////////////////////\n");
        }
        if(Q == 5){
            int A =0;
            printf("\nВведите четырёхзначное число:");
            scanf("%d",&A);
            if(A%10 == A/1000%10 && A/100%10 == A/10%10){
                printf("Данное число читается одинаково слева направо и справа налево\n");
                }
            else{printf("Данное число НЕ читается одинаково слева направо и справа налево");}
            printf("/////////////////////////////////////////////////////////////////\n");
        }
        if(Q == 6){
            int A = 0, B = 0,C = 0;
            printf("\nВведите A,B,C(стороны треугольника):");
            scanf("%d %d %d",&A,&B,&C);
            if((pow(A,2)+pow(B,2) == pow(C,2))||((B,2)+pow(C,2) == pow(A,2))||((A,2)+pow(C,2) == pow(B,2))){
                printf("Треугольник со сторонами a, b, c является прямоугольным\n");
            }
            else{printf("Треугольник со сторонами a, b, c НЕ является прямоугольным\n");}
            printf("/////////////////////////////////////////////////////////////////\n");
        }
        if(Q == 7){
            int A = 0, B = 0,C = 0;
            printf("\nВведите A,B,C(стороны треугольника):");
            scanf("%d %d %d",&A,&B,&C);
            if((A + B <= C) || (A + C <= B)|| (B + C <= A)){
                printf("Существует треугольник со сторонами a, b, c\n");
            }
            else{printf("НЕ существует треугольник со сторонами a, b, c\n");}
            printf("/////////////////////////////////////////////////////////////////\n");
        }
    }
    return 0;
}
