#include <stdio.h>
#include <locale.h>
#include <math.h>
#include <stdlib.h>
int main()
{
    setlocale(LC_ALL, "Rus");
    int Q = 0, i = 0;
    while (i < 5){
        printf("Введите номер задания:");
        scanf("%d",&Q);
        i++;
        if(Q == 1){
            int D = 0, M = 0;
            printf("Введите номер дня:");
            scanf("%d", &D);
            printf("Введите номер месяца:");
            scanf("%d", &M);
            if (D == 1){printf("первое");}
            if (D == 2){printf("второе");}
            if (D == 3){printf("третье");}
            if (D == 4){printf("четвёртое");}
            if (D == 5){printf("пятое");}
            if (D == 6){printf("шестое");}
            if (D == 7){printf("седьмое");}
            if (D == 8){printf("восьмое");}
            if (D == 9){printf("девятое");}
            if (D == 10){printf("десятое");}
            if (D == 11){printf("одиннадцатое");}
            if (D == 12){printf("двенадцатое");}
            if (D == 13){printf("тринадцатое");}
            if (D == 14){printf("четырнадцатое");}
            if (D == 15){printf("пятнадцатое");}
            if (D == 16){printf("шестнадцатое");}
            if (D == 17){printf("семнадцатое");}
            if (D == 18){printf("восемнадцатое");}
            if (D == 19){printf("девятнадцатое");}
            if (D == 20){printf("двадцатое");}
            if (D == 21){printf("двадцатьпервое");}
            if (D == 22){printf("двадцатьвторое");}
            if (D == 23){printf("двадцатьтретье");}
            if (D == 24){printf("двадцатьчетврётое");}
            if (D == 25){printf("двадцатьпятое");}
            if (D == 26){printf("двадцатьшестое");}
            if (D == 27){printf("двадцатьседьмое");}
            if (D == 28){printf("двадцатьвосьмое");}
            if (D == 29){printf("двадцатьдевятое");}
            if (D == 30){printf("тридцатое");}
            if (D == 31){printf("тридцатьпервое");}
            if (M == 1){printf(" января");}
            if (M == 2){printf(" февраля");}
            if (M == 3){printf(" марта");}
            if (M == 4){printf(" апреля");}
            if (M == 5){printf(" мая");}
            if (M == 6){printf(" июня");}
            if (M == 7){printf(" июля");}
            if (M == 8){printf(" августа");}
            if (M == 9){printf(" сентября");}
            if (M == 10){printf(" октября");}
            if (M == 11){printf(" ноября");}
            if (M == 12){printf(" декабря");}
            printf("\n/////////////////////////////////////////////////////////////////\n");
        }
        if(Q == 2){
            char C;
            int N = 0;
            printf("Введите направление:");
            scanf("%s", &C);
            printf("Введите действие:");
            scanf("%d", &N);
            printf("%s", C);
            if(C == -48){
                if(N == 0){printf("Робот направляется на Север");}
                if(N == 1){printf("Робот направляется на Запад");}
                if(N == -1){printf("Робот направляется на Восток");}
            }
        }
        if(Q == 3){
            int D = 0;
            printf("Введите количество заданий:");
            scanf("%d", &D);
            if (D == 1){printf("одно учебное задание");}
            if (D == 2){printf("два");}
            if (D == 3){printf("три");}
            if (D == 4){printf("четыре");}
            if (D == 5){printf("пять");}
            if (D == 6){printf("шесть");}
            if (D == 7){printf("семь");}
            if (D == 8){printf("восемь");}
            if (D == 9){printf("девять");}
            if (D == 10){printf("десять");}
            if (D == 11){printf("одиннадцать");}
            if (D == 12){printf("двенадцать");}
            if (D == 13){printf("тринадцать");}
            if (D == 14){printf("четырнадцать");}
            if (D == 15){printf("пятнадцать");}
            if (D == 16){printf("шестнадцать");}
            if (D == 17){printf("семнадцать");}
            if (D == 18){printf("восемнадцать");}
            if (D == 19){printf("девятнадцать");}
            if (D == 20){printf("двадцать");}
            if (D == 21){printf("двадцатьодно учебное задание");}
            if (D == 22){printf("двадцатьдва");}
            if (D == 23){printf("двадцатьтри");}
            if (D == 24){printf("двадцатьчетыре");}
            if (D == 25){printf("двадцатьпять");}
            if (D == 26){printf("двадцатьшесть");}
            if (D == 27){printf("двадцатьсемь");}
            if (D == 28){printf("двадцатьвосьмь");}
            if (D == 29){printf("двадцатьдевять");}
            if (D == 30){printf("тридцать");}
            if (D == 31){printf("тридцатьодно учебное задание");}
            if (D == 32){printf("тридцатьдва");}
            if (D == 33){printf("тридцатьтри");}
            if (D == 34){printf("тридцатьчетыре");}
            if (D == 35){printf("тридцатьпять");}
            if (D == 36){printf("тридцатьшесть");}
            if (D == 37){printf("тридцатьсемь");}
            if (D == 38){printf("тридцатьвосемь");}
            if (D == 39){printf("тридцатьдевять");}
            if (D == 40){printf("сорок");}
            if( (D!=1)&& (D!=21) && (D!=31)){printf(" учебных заданий");}
            printf("\n/////////////////////////////////////////////////////////////////\n");
        }
        if(Q == 4){
            int D = 0;
            printf("Введите число:");
            scanf("%d", &D);
            if(D/100%10 == 1){
                printf("сто ");
                if(D/10%10 == 1){
                    if (D%10 == 0){printf("десять");}
                    if (D%10 == 1){printf("одиннадцать");}
                    if (D%10 == 2){printf("двенадцать");}
                    if (D%10 == 3){printf("тринадцать");}
                    if (D%10 == 4){printf("четырнадцать");}
                    if (D%10 == 5){printf("пятнадцать");}
                    if (D%10 == 6){printf("шестнадцать");}
                    if (D%10 == 7){printf("семнадцать");}
                    if (D%10 == 8){printf("восемнадцать");}
                    if (D%10 == 9){printf("девятнадцать");}
                }
                if(D/10%10 == 2){
                    printf("двадцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 3){
                    printf("тридцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 4){
                    printf("сорок ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 5){
                    printf("пятьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("шестьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 7){
                    printf("семьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("восемьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("девяносто ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
            }
            if(D/100%10 == 2){
                printf("двести ");
                if(D/10%10 == 1){
                    if (D%10 == 0){printf("десять");}
                    if (D%10 == 1){printf("одиннадцать");}
                    if (D%10 == 2){printf("двенадцать");}
                    if (D%10 == 3){printf("тринадцать");}
                    if (D%10 == 4){printf("четырнадцать");}
                    if (D%10 == 5){printf("пятнадцать");}
                    if (D%10 == 6){printf("шестнадцать");}
                    if (D%10 == 7){printf("семнадцать");}
                    if (D%10 == 8){printf("восемнадцать");}
                    if (D%10 == 9){printf("девятнадцать");}
                }
                if(D/10%10 == 2){
                    printf("двадцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 3){
                    printf("тридцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 4){
                    printf("сорок ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 5){
                    printf("пятьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("шестьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 7){
                    printf("семьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("восемьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("девяносто ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
            }
            if(D/100%10 == 3){
                printf("триста ");
                if(D/10%10 == 1){
                    if (D%10 == 0){printf("десять");}
                    if (D%10 == 1){printf("одиннадцать");}
                    if (D%10 == 2){printf("двенадцать");}
                    if (D%10 == 3){printf("тринадцать");}
                    if (D%10 == 4){printf("четырнадцать");}
                    if (D%10 == 5){printf("пятнадцать");}
                    if (D%10 == 6){printf("шестнадцать");}
                    if (D%10 == 7){printf("семнадцать");}
                    if (D%10 == 8){printf("восемнадцать");}
                    if (D%10 == 9){printf("девятнадцать");}
                }
                if(D/10%10 == 2){
                    printf("двадцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 3){
                    printf("тридцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 4){
                    printf("сорок ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 5){
                    printf("пятьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("шестьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 7){
                    printf("семьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("восемьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("девяносто ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
            }
            if(D/100%10 == 4){
                printf("четыреста ");
                if(D/10%10 == 1){
                    if (D%10 == 0){printf("десять");}
                    if (D%10 == 1){printf("одиннадцать");}
                    if (D%10 == 2){printf("двенадцать");}
                    if (D%10 == 3){printf("тринадцать");}
                    if (D%10 == 4){printf("четырнадцать");}
                    if (D%10 == 5){printf("пятнадцать");}
                    if (D%10 == 6){printf("шестнадцать");}
                    if (D%10 == 7){printf("семнадцать");}
                    if (D%10 == 8){printf("восемнадцать");}
                    if (D%10 == 9){printf("девятнадцать");}
                }
                if(D/10%10 == 2){
                    printf("двадцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 3){
                    printf("тридцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 4){
                    printf("сорок ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 5){
                    printf("пятьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("шестьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 7){
                    printf("семьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("восемьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("девяносто ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
            }
            if(D/100%10 == 5){
                printf("пятьсот ");
                if(D/10%10 == 1){
                    if (D%10 == 0){printf("десять");}
                    if (D%10 == 1){printf("одиннадцать");}
                    if (D%10 == 2){printf("двенадцать");}
                    if (D%10 == 3){printf("тринадцать");}
                    if (D%10 == 4){printf("четырнадцать");}
                    if (D%10 == 5){printf("пятнадцать");}
                    if (D%10 == 6){printf("шестнадцать");}
                    if (D%10 == 7){printf("семнадцать");}
                    if (D%10 == 8){printf("восемнадцать");}
                    if (D%10 == 9){printf("девятнадцать");}
                }
                if(D/10%10 == 2){
                    printf("двадцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 3){
                    printf("тридцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 4){
                    printf("сорок ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 5){
                    printf("пятьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("шестьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 7){
                    printf("семьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("восемьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("девяносто ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
            }
            if(D/100%10 == 6){
                printf("шестьсот ");
                if(D/10%10 == 1){
                    if (D%10 == 0){printf("десять");}
                    if (D%10 == 1){printf("одиннадцать");}
                    if (D%10 == 2){printf("двенадцать");}
                    if (D%10 == 3){printf("тринадцать");}
                    if (D%10 == 4){printf("четырнадцать");}
                    if (D%10 == 5){printf("пятнадцать");}
                    if (D%10 == 6){printf("шестнадцать");}
                    if (D%10 == 7){printf("семнадцать");}
                    if (D%10 == 8){printf("восемнадцать");}
                    if (D%10 == 9){printf("девятнадцать");}
                }
                if(D/10%10 == 2){
                    printf("двадцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 3){
                    printf("тридцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 4){
                    printf("сорок ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 5){
                    printf("пятьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("шестьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 7){
                    printf("семьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("восемьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("девяносто ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
            }
            if(D/100%10 == 7){
                printf("семьсот ");
                if(D/10%10 == 1){
                    if (D%10 == 0){printf("десять");}
                    if (D%10 == 1){printf("одиннадцать");}
                    if (D%10 == 2){printf("двенадцать");}
                    if (D%10 == 3){printf("тринадцать");}
                    if (D%10 == 4){printf("четырнадцать");}
                    if (D%10 == 5){printf("пятнадцать");}
                    if (D%10 == 6){printf("шестнадцать");}
                    if (D%10 == 7){printf("семнадцать");}
                    if (D%10 == 8){printf("восемнадцать");}
                    if (D%10 == 9){printf("девятнадцать");}
                }
                if(D/10%10 == 2){
                    printf("двадцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 3){
                    printf("тридцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 4){
                    printf("сорок ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 5){
                    printf("пятьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("шестьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 7){
                    printf("семьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("восемьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("девяносто ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
            }
            if(D/100%10 == 8){
                printf("восемьсот ");
                if(D/10%10 == 1){
                    if (D%10 == 0){printf("десять");}
                    if (D%10 == 1){printf("одиннадцать");}
                    if (D%10 == 2){printf("двенадцать");}
                    if (D%10 == 3){printf("тринадцать");}
                    if (D%10 == 4){printf("четырнадцать");}
                    if (D%10 == 5){printf("пятнадцать");}
                    if (D%10 == 6){printf("шестнадцать");}
                    if (D%10 == 7){printf("семнадцать");}
                    if (D%10 == 8){printf("восемнадцать");}
                    if (D%10 == 9){printf("девятнадцать");}
                }
                if(D/10%10 == 2){
                    printf("двадцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 3){
                    printf("тридцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 4){
                    printf("сорок ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 5){
                    printf("пятьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("шестьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 7){
                    printf("семьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("восемьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("девяносто ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
            }
            if(D/100%10 == 9){
                printf("девятьсот ");
                if(D/10%10 == 1){
                    if (D%10 == 0){printf("десять");}
                    if (D%10 == 1){printf("одиннадцать");}
                    if (D%10 == 2){printf("двенадцать");}
                    if (D%10 == 3){printf("тринадцать");}
                    if (D%10 == 4){printf("четырнадцать");}
                    if (D%10 == 5){printf("пятнадцать");}
                    if (D%10 == 6){printf("шестнадцать");}
                    if (D%10 == 7){printf("семнадцать");}
                    if (D%10 == 8){printf("восемнадцать");}
                    if (D%10 == 9){printf("девятнадцать");}
                }
                if(D/10%10 == 2){
                    printf("двадцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 3){
                    printf("тридцать ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 4){
                    printf("сорок ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 5){
                    printf("пятьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("шестьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 7){
                    printf("семьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("восемьдесят ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
                if(D/10%10 == 6){
                    printf("девяносто ");
                    if (D%10 == 1){printf("один");}
                    if (D%10 == 2){printf("два");}
                    if (D%10 == 3){printf("три");}
                    if (D%10 == 4){printf("четыре");}
                    if (D%10 == 5){printf("пять");}
                    if (D%10 == 6){printf("шесть");}
                    if (D%10 == 7){printf("семь");}
                    if (D%10 == 8){printf("восемь");}
                    if (D%10 == 9){printf("девять");}
                }
            }
            printf("\n/////////////////////////////////////////////////////////////////\n");
        }
        if(Q == 5){
            int D = 0;
            printf("Введите год:");
            scanf("%d", &D);
            D = D - 1984;
            int S = D/12;
            int G = D/60;
            while(G >= 5){
                G = G - 5;
            }
            printf("год");
        }
    }
    return 0;
}