/******************************************************************************

                            Online C Compiler.
                Code, Compile, Run and Debug C program online.
Write your code in this editor and press "Run" button to compile and execute it.

*******************************************************************************/

#include <stdio.h>

int main()
{
    printf("1. Дано целое число N (> 0). Сформировать и вывести целочисленный массив размера N, содержащий N первых положительных нечетных чисел: 1, 3, 5, . . . .\n");
    int N = 0, i = 0, s = 1;
    printf("Введите N:");
    scanf("%d", &N);
    int a[N];
    while(i!=N){
        a[i] = s;
        s = s + 2;
        i++;
    }
    i = 0;
    while(i!=N){
        printf("%d ",a[i]);
        i++;
    }
    printf("\n////////////////////////////////////////////////////////////////////\n");
    printf("2. Дано целое число N (> 1), а также первый член A и знаменатель D геометрической прогрессии. Сформировать и вывести массив размера N, содержащий N первых членов данной прогрессии: A, A·D, A·D2 , A·D3 , . . .\n");
    N = 0, i = 1, s = 0;
    int A = 0, D = 0;
    printf("Введите N:");
    scanf("%d", &N);
    printf("Введите A:");
    scanf("%d", &A);
    printf("Введите D:");
    scanf("%d", &D);
    int b[N];
    b[0] = A;
    s = D;
    while(i!=N){
        b[i] = A*s;
        s = s*D;
        i++;
    }
    i = 0;
    while(i!=N){
        printf("%d ",b[i]);
        i++;
    }
    printf("\n////////////////////////////////////////////////////////////////////\n");
    printf("3. Даны целые числа N (> 2), A и B. Сформировать и вывести целочисленный массив размера N, первый элемент которого равен A, второй равен B, а каждый последующий элемент равен сумме всех предыдущих\n");
    N = 0, i = 2, s = 1, A = 0;
    int B = 0;
    printf("Введите N:");
    scanf("%d", &N);
    printf("Введите A:");
    scanf("%d", &A);
    printf("Введите B:");
    scanf("%d", &B);
    int c[N];
    c[0] = A;
    c[1] = B;
    while(i!=N){
        s = c[i-2] + c[i-1];
        c[i] = s;
        i++;
    }
    i = 0;
    while(i!=N){
        printf("%d ",c[i]);
        i++;
    }
    printf("\n////////////////////////////////////////////////////////////////////\n");
    N = 0, i = 0;
    printf("Введите N:");
    scanf("%d", &N);
    int d[N];
    while(i!=N){
        scanf("%d", &d[i]);  
        i++;
    }
    i = 0;
    printf("\n");
    while(i!=N/2){
        printf("%d\n", d[i]);
        printf("%d\n", d[N-i-1]);
        i++;
    }
    if(N%2 != 0){
        i++;
        printf("%d\n", d[i-1]);
    }
    printf("\n////////////////////////////////////////////////////////////////////\n");
    printf("5. Дан массив A размера N. Вывести вначале его элементы с нечетными номерами в порядке возрастания номеров, а затем — элементы с четными номерами в порядке убывания номеров\n");
    N = 0, i = 0;
    printf("Введите N:");
    scanf("%d", &N);
    int f[N];
    while(i!=N){
        scanf("%d", &f[i]);  
        i++;
    }
    printf("\n");
    i = 0;
    while(i<N){
        printf("%d\n", f[i]);
        i = i + 2;
    }
    printf("\n");
    i = 0;
    if(N%2 == 0){
        N--;
    }
    while(N>=0){
        printf("%d\n", f[N]);
        N = N - 2;
    }
}
