#include <stdio.h>
#include <locale.h>
#include <math.h>
int main()
{
    setlocale(LC_ALL, "Rus");
    int Q = 0, i = 0;
    while (i < 5){
        printf("Введите номер задания:");
        scanf("%d",&Q);
        i++;
        if(Q == 1){
            printf("\n1. Дано вещественное число — цена 1 кг конфет. Вывести стоимость 0.1, 0.2, . . . , 1 кг конфет.");
            float A = 0;
            printf("\nВведите цену одного кг конфет:");
            scanf("%f",&A);
            printf("0.1кг =%f\n", A*0.1);
            printf("0.2кг =%f\n", A*0.2);
            printf("0.3кг =%f\n", A*0.3);
            printf("0.4кг =%f\n", A*0.4);
            printf("0.5кг =%f\n", A*0.5);
            printf("0.6кг =%f\n", A*0.6);
            printf("0.7кг =%f\n", A*0.7);
            printf("0.8кг =%f\n", A*0.8);
            printf("0.9кг =%f\n", A*0.9);
            printf("/////////////////////////////////////////////////////////////////\n");
        } 
        if(Q == 2){
            printf("\n2. Дано целое число N (> 0). Найти произведение 1.1 · 1.2 · 1.3 · . . . (N сомножителей).");
            float N = 0;
            float S = 1, k = 1.1;
            printf("\nВведите N:");
            scanf("%f",&N);
            while (N != 0){
                S = S * k;
                k = k + 0.1;
                N--;
            }
            printf("%f\n", S);
            printf("/////////////////////////////////////////////////////////////////\n");
        }
        if(Q == 3){
            printf("\n3. Дано целое число N (> 0). Найти квадрат данного числа, используя для его вычисления следующую формулу: N2 = 1 + 3 + 5 + . . . + (2·N − 1). После добавления к сумме каждого слагаемого выводить текущее значение суммы");
            printf("\nВведите число:");
            int N = 0, K = 1, s = 0, Y = 0;
            scanf("%d",&N);
            while(K!=N+1){
                s = (2*K - 1);
                Y = Y + s;
                K++;
                printf("%d\n", Y);
            }
            printf("/////////////////////////////////////////////////////////////////\n");
        }
        if(Q == 4){
            printf("\n4. Дано вещественное число A и целое число N (> 0). Используя один цикл, найти сумму 1 + A + A2 + A3 + . . . + AN");
            int A =0, N = 0, m = 0, S = 0;
            printf("\nВведите A =");
            scanf("%d",&A);
            printf("\nВведите N =");
            scanf("%d",&N);
            while(m != N+1){
                S = S + pow(A, m);
                m++;
            }
            printf("%d\n", S);
            printf("/////////////////////////////////////////////////////////////////\n");
        }
        if(Q == 5){
            printf("\n5. Дано вещественное число A и целое число N (> 0). Используя один цикл, найти значение выражения 1 − A + A2 − A3 + . . . ± AN . Условный оператор не использовать.");
            int A =0, N = 0, m = 1, S = 1, i = -1;
            printf("\nВведите A =");
            scanf("%d",&A);
            printf("\nВведите N =");
            scanf("%d",&N);
            while(m != N+1){
                S = S + i*pow(A, m);
                m++;
                i = i *(-1);
            }
            printf("%d\n", S);
            printf("/////////////////////////////////////////////////////////////////\n");
        }
    }
    return 0;
}